Tekla Open API Reference for Tekla Structures 2025
DimensionLink.GetDimension1 Method
 Gets the first one of the linked dimensions.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StraightDimensionSet GetDimension1()
Public Function GetDimension1 As StraightDimensionSet
Return Value
Type: StraightDimensionSet
The first one of the linked dimensions.
See Also
Reference
DimensionLink Class
Tekla.Structures.Drawing Namespace